export const cities = [
    "Москва", "Санкт-Петербург", "Новосибирск", "Екатеринбург", "Нижний Новгород", "Казань", "Челябинск", "Омск", "Самара", "Ростов-на-Дону",
    "Уфа", "Красноярск", "Пермь", "Воронеж", "Волгоград", "Краснодар", "Саратов", "Тюмень", "Тольятти", "Ижевск",
    "Барнаул", "Ульяновск", "Иркутск", "Хабаровск", "Ярославль", "Владивосток", "Махачкала", "Томск", "Оренбург", "Кемерово",
    "Новокузнецк", "Рязань", "Астрахань", "Пенза", "Липецк", "Киров", "Чебоксары", "Тула", "Курск", "Севастополь",
    "Сочи", "Ставрополь", "Улан-Удэ", "Тверь", "Магнитогорск", "Иваново", "Брянск", "Белгород", "Сургут", "Владимир",
    "Архангельск", "Чита", "Калуга", "Смоленск", "Калининград", "Курган", "Якутск", "Грозный", "Баку", "Гянджа",
    "Сумгаит", "Минск", "Гомель", "Могилёв", "Витебск", "Гродно", "Брест", "Бобруйск", "Барановичи", "Борисов",
    "Пинск", "Орша", "Солигорск", "Алматы", "Нур-Султан", "Шымкент", "Караганда", "Актобе", "Тараз", "Павлодар",
    "Усть-Каменогорск", "Семей", "Костанай", "Кызылорда", "Атырау", "Петропавловск", "Темиртау", "Туркестан", "Уральск", "Экибастуз",
    "Рудный", "Жезказган", "Алма-Ата", "Ташкент", "Самарканд", "Наманган", "Андижан", "Бухара", "Нукус", "Карши",
    "Коканд", "Фергана", "Джизак", "Наваи", "Термез", "Гулистан", "Худжанд", "Душанбе", "Хорог", "Бишкек",
    "Ош", "Джалал-Абад", "Каракол", "Токмок", "Нарын", "Баткен", "Талас", "Кызыл-Кия", "Кара-Балта", "Балыкчы",
    "Ереван", "Гюмри", "Ванадзор", "Тбилиси", "Кутаиси", "Батуми", "Кишинёв", "Тирасполь", "Рига", "Вильнюс",
    "Таллин", "Каунас", "Клайпеда", "Шяуляй", "Паневежис", "Даугавпилс", "Лиепая", "Тарту", "Нарва", "Пярну"
  ]
  